tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/fonts"

# iOS
brew "carthage"
brew "chisel"
brew "swiftlint"
brew "swiftformat"
brew "xctool"
brew "ideviceinstaller"
brew "appledoc"
brew "cocoapods"
brew "sourcery"
brew "ios-deploy"

# git
brew "git"
brew "git-extras"
brew "git-flow-avh"
brew "git-lfs"
brew "gist"
brew "tig"

# languages
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "python"
brew "ruby"
brew "rbenv"
brew "erlang"
brew "haskell-stack"
brew "lua"
brew "luarocks"
brew "go"

# linter
brew "prettier"
brew "gitlint"
brew "shellcheck"
brew "eslint"

# shells
brew "fish"

brew "bash"
brew "bash-completion@2"

brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Networking
brew "iperf3"
brew "iftop"
brew "nmap"
brew "wget", args: ["with-iri"]
brew "curl"

# shell tools
brew "vim", args: ["with-override-system-vi"]
brew "neovim"
brew "htop"
brew "tmux"
brew "the_silver_searcher"
brew "ack"
brew "automake"
brew "cmake"

brew "icdiff"
brew "z"    # Fuzzy cd
brew "cloc" # Count Lines Of Code
brew "duti"
brew "bat"
brew "rmtrash"
brew "plantuml"
brew "ffmpeg"
brew "tree"
brew "mas"
brew "fswatch"
brew "openssl"
brew "openssh"
brew "tldr"
# brew "coreutils"
# brew "multitail"
# brew "exercism"

cask "alfred"
cask "macvim"
cask "hammerspoon"
cask "iterm2"
cask "kitty"
cask "sublime-text"
cask "dash"
cask "sourcetree"
cask "sketch"
cask "hopper-disassembler"
cask "uncrustifyx"
cask "simsim"
cask "arduino"
cask "fritzing"
cask "vlc"
cask "wireshark"
cask "visual-studio"
cask "visual-studio-code"
cask "docker"
cask "font-fira-code"
cask "font-menlo-for-powerline"
cask "font-source-code-pro"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "quicklookapk"
cask "suspicious-package"

# cask "quickradar"
# cask "kdiff3"
# cask "little-snitch"
# cask "micro-snitch"

mas "Fantastical 2", id: 975937182
mas "Xcode", id: 497799835
